driver-tests/bpelse/assign/AssignNamespacesJBI/test/results/AttrQname6/Actual_20130221153646_F.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <partElement xmlns="http://j2ee.netbeans.org/wsdl/attrQnameAssign_withStructPart" xmlns:att="http://j2ee.netbeans.org/wsdl/attrQnameAssign_withStructPart" xmlns:msgns="http://j2ee.netbeans.org/wsdl/attrQnameAssign_withStructPart" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" att:newAttribute="AttrQname6:someVal">
      <att:newElement>AttrQname6</att:newElement>
      <att:nestedElement xmlns:AttrQname6="http://j2ee.netbeans.org/wsdl/attrQnameAssign_withStructPart" att:newAttribute="AttrQname6:someVal"/>
    </partElement>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>