driver-tests/bpelse/assign/AssignNamespacesJBI/test/AttrQname3/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:att="http://j2ee.netbeans.org/wsdl/attrQnameAssign_withStructPart">
  <soapenv:Body xmlns:AttrQname3="http://j2ee.netbeans.org/wsdl/attrQnameAssign_withStructPart">
    <att:partElement att:newAttribute="AttrQname3:someVal">
      <att:newElement>AttrQname3</att:newElement>
    </att:partElement>
  </soapenv:Body>
</soapenv:Envelope>